# ------------------------ ПРОЦЕССЫ --------------------
# import time
#
# from multiprocessing import Process
#
# # Функция, которая будет работать в отдельном процессе
# def printer(name):
#     time.sleep(3)
#     print('привет', name)
# # Необходимо отделить точку входа в программу
# # При создании процесса запускается Python-интерпретатор.
# # Когда подгрузятся модули, он будет выполнять код, который находится на их уровне.
# # То есть, если убрать `if __name__ == '__main__':`,
# # процессы начнут создаваться рекурсивно,  и в итоге они создадут fork-бомбу.
# # К счастью, Python не позволит запустить программу без явной точки входа,
# # и не даст уйти процессу в рекурсию.
# if __name__ == '__main__':
#     # Создаём объект процесса, передав в него функцию и аргументы, с которыми он будет вызван
#     p = Process(target=printer, args=('Алиса',))
#     # Запускаем
#     p.start()
#     print('Пока выполняется процесс, съешьте ещё этих мягких французских булок да выпейте чаю ☕️ ')
#     # Дождёмся выполнения процесса
#     p.join()
#     print('Завершение работы')


# import time
# import os
#
# from multiprocessing import Process
#
#
# def printer(name):
#     # Проверим гипотезу и увеличим время выполнения функции, чтобы процесс не завершился раньше
#     time.sleep(50)
#     print('привет', name)
#
#
# if __name__ == '__main__':
#
#     p = Process(target=printer, args=('Боб',))
#     p.start()
#     print('Пока выполняется процесс, съешьте ещё этих мягких французских булок да выпейте чаю ☕️ ')
#     # Выведем Process ID для текущего процесса и для процесса, который только что запустили
#     print('Главный PID', os.getpid())
#     print('Дочерний PID', p.pid)
#     # Дождёмся выполнения процесса
#     p.join()
#     print('Завершение работы')

# --------------------- ПОТОКИ ----------------------------------------
# import time
#
# # Вместо multiprocessing используем threading
# from threading import Thread
#
#
# def printer(name):
#     time.sleep(3)
#     print('привет', name)
#
#
# # Интерфейс похож на работу с процессами
# t = Thread(target=printer, args=('Алиса',))
# t.start()
# print('Пока выполняется процесс, съешьте ещё этих мягких французских булок да выпейте чаю ☕️ ')
# # Дождёмся выполнения операции в потоке потока
# t.join()


import sys

# Переменная 'a' первая ссылается на объект object()
a = object()
# Переменная 'b' вторая ссылается на объект object()
b = a
# Так как вы передаёте переменную 'a', которая ссылается на объект, аргумент функции тоже будет ссылаться на этот объект
# В итоге на объект будет указывать три ссылки
print(sys.getrefcount(a))